import { test } from '@playwright/test';

/*
Frontier Id: 6681
Area: Администрирование/Права доступа/Группы/Системные разрешения
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: e2euser2 в группе "тестовая группа", все разрешения сняты
в системе  существует Тип связи
Expected: **Сайдбар:**
- В разделе "Метаданные" кнопка "Типы связей" — активна

**Страница /linktype:**
- Открывается, отображается toolbar "Типы связей"
- Нет кнопки "Создать тип связи" в toolbar
- Если типы связей существуют — в строках нет кнопок edit/delete ИЛИ они disabled

** Другие разделы системы**
- Другие разделы системы, такие как Модель статусов(Статусы, Действия, Схема жизненного цикла), Метаданные(Справочники, Категории), Права доступа(Создание прав доступа, Группы, Внешние роли, Пользователи), Администирование(Бизнес-процессы, Настройки системы) отсутствуют на странице
Step 0: rex-admin: включить "Просмотр типов связей", сохранить
Step 1: Выйти, залогиниться под e2euser2
Импорт в Frontier: testcases-import/6681.json
*/

test('6681 Разрешение: Просмотр типов связей', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
