import { test } from '@playwright/test';

/*
Frontier Id: 6754
Area: Администрирование/Модель статусов/Статусы
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором
Expected: 
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Статусы
Step 3: Создать новый статус, заполнив Название статуса

Step 4: Статус появлился в списке статусов на странице Статусы
Step 5: Новый статус доступен на форме создания Действия
Step 6: Новый статус отображается на Схеме жизненного цикла

Step 7: Новый статус доступен при создании Права доступа

Импорт в Frontier: testcases-import/6754.json
*/

test('6754 Создание Статуса без действий', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
