import { test } from '@playwright/test';

/*
Frontier Id: 6769
Area: Администрирование/Модель статусов/Статусы
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором. В системе существует доабавленный статус 'Тестовый статус'
Expected: Статус 'Тестовый статус' исчез из списка статусов
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Статусы
Step 3: Найти Тестовый статус
Step 4: Нажать иконку Удалить напротив Тестового статуса
Step 5: Подтвердить удаление в диалоговом окне
Step 6: Проверить toast сообщение об успешном удалении
Импорт в Frontier: testcases-import/6769.json
*/

test('6769 Удаление Статуса', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
