import { test } from '@playwright/test';

/*
Frontier Id: 6741
Area: Администрирование/Модель статусов/Статусы
Priority: Low Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором
Expected: Появилось валидационное сообщение  - Требуется задать значение
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Статусы
Step 3: Попытаться создать новый статус не заполняя поле "Название статуса"
Step 4: Проверить валидационное сообщение под полем Название статуса
Импорт в Frontier: testcases-import/6741.json
*/

test('6741 Валидация обязательного поля \'Название статуса\' при создании статуса', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
