import { test } from '@playwright/test';

/*
Frontier Id: 6770
Area: Администрирование/Модель статусов/Статусы
Priority: Low Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором
Expected: 
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Статусы
Step 3: Открыть форму создания Статуса
Step 4: Заполнить поле Название статуса значением Создан
Step 5: Попытаться создать статус
Step 6: Проверить всплывающее сообщение об ошибке
Step 7: Убедиться, что в списке статусов только один статус с именем Создан
Импорт в Frontier: testcases-import/6770.json
*/

test('6770 Нельзя создать статус с уже существующим именем', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
