import { test } from '@playwright/test';

/*
Frontier Id: 6771
Area: Администрирование/Модель статусов/Статусы
Priority: Medium Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором
Expected: Появилось валидационное сообщение  - Максимальная длина 16 символов
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Статусы
Step 3: Создать новый статус, заполнив Название статуса более чем 16 символов
Step 4: Проверить валидационное сообщение под полем Название статуса
Импорт в Frontier: testcases-import/6771.json
*/

test('6771 Валидация поля Название статуса - не более 16 символов', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
