import { test } from '@playwright/test';

/*
Frontier Id: 6773
Area: Администрирование/Модель статусов/Действия
Priority: Medium Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь является администратором
Expected: 
Step 0: Открыть Админку
Step 1: Авторизоваться как Administrator
Step 2: Перейти на страницу Действия
Step 3: Нажать кнопку 'Создать действие'
  expect: Открылось даилоговое окно 'Создать действие'. В окне отображаются поля
1) текстовое поле ввода с заголовком 'Название действия*' и плейсхолдером 'Введите название'
2) чекбокс 'Без перехода по статусам'
3) Выпадающий список с заголовком 'Результирующий статус*' и плейсхолдером 'Выбери статус'

Step 4: В появившемся диалоговом окне 'Создать действие' заполнить поле 'Название действия' 
Step 5: Установить галочку напротив 'Без перехода по статусам'
  expect: Выпадающий список с заголовком 'Результирующий статус*' и плейсхолдером 'Выбери статус' исчез из диалогового окна

Step 6: Нажать кнопку Создать

Step 7: Проверить, что только что созданное действие отображается в списке действий. В колонке Результирующий статус отображается надпись 'Без перехода по статусам'
Импорт в Frontier: testcases-import/6773.json
*/

test('6773 Создание Действия Без перехода по статусам', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
