import { test } from '@playwright/test';

/*
Frontier Id: 6776
Area: Администрирование/Права доступа/Группы/Процессы создания
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: В системе существует Тестовая группа. 
В Тестовой группе имеется Пользователь. (e2euser2)
Имеется отдельный пользователь с правами администратора. (e2euser1)
В системе имеется несколько процессов Создания активов
Expected: Кнопка Загрузить активна, присутствует возможность выбрать процесс загрузки.
Step 0: Залогиниться под e2euser1 в Admin панели

Step 1: Перейти: Права доступа → Группы → редактирование 'тестовая группа' → вкладка 'Процессы создания'
Step 2: Установить галочки на нескольких  Процессах создания
Step 3: Нажать 'Сохранить'
Step 4: Выйти из системы (кнопка профиля → 'Выйти')
Step 5: Залогиниться в Библиотеке под e2euser2
Step 6: Проверить кнопку Загрузить
Импорт в Frontier: testcases-import/6776.json
*/

test('6776 У группы пользователей есть несколько прав на Создание актива', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
