import { test } from '@playwright/test';

/*
Frontier Id: 8219
Area: Группы пользователей/Непродуктовый загрузчик
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь авторизован в системе с правами группы "Непродуктовый загрузчик"
Expected: Актив успешно удаляется из системы.
Step 0: Открыть карточку актива в статусе 'Открыт'
  expect:  Карточка загружена
Step 1: Нажать кнопку 'Удалить'
  expect:  Появляется запрос на подтверждение: Вы действительно хотите удалить актив? Восстановить его будет нельзя.
Step 2: Подтвердить действие
  expect:  Актив удаляется, появляется окно успеха операции - "Актив был удален".
Импорт в Frontier: testcases-import/8219.json
*/

test('8219 Позитивный: Удаление актива в статусе "Открыт"', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
