import { test } from '@playwright/test';

/*
Frontier Id: 8215
Area: Группы пользователей/Непродуктовый загрузчик
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь авторизован в системе с правами группы "Непродуктовый загрузчик"
Expected: Файл актива успешно выгружается на устройство пользователя.
Step 0: Открыть карточку актива в статусе 'Создан'
  expect:  Карточка загружена корректно
Step 1: Нажать кнопку 'Выгрузить'
  expect:  Запускается процесс скачивания файла
Step 2: Проверить сохранение файла на устройство
  expect:  Файл успешно сохранен без искажений
Импорт в Frontier: testcases-import/8215.json
*/

test('8215 Позитивный: Выгрузка актива в статусе "Создан"', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
