import { test } from '@playwright/test';

/*
Frontier Id: 8223
Area: Группы пользователей/Непродуктовый загрузчик
Priority: High Status: Actual
Automation: manual
Reason: Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.
Preconditions: Пользователь авторизован в системе с правами группы "Непродуктовый загрузчик"
Expected: Доступ к активам в статусах В обработке, На проверке, Нужно доработать, Обработан, Одобрен, Отклонен заблокирован.
Step 0: Открыть список активов
  expect:  Список загружен
Step 1: В фильтре попытаться выбрать статус 'В обработке'
  expect:  В списке  нет статуса
Step 2: Аналогично предыдущему шагу попытаться выбрать другие статусы и списка
  expect: В обработке
Импорт в Frontier: testcases-import/8223.json
*/

test('8223 Негативный: Попытка просмотра актива в статусе отличном от "Создан" и "Открыт"', async () => {
  test.fixme(true, 'Админка, роли и права. Автотест не меняет пользователей, группы и разрешения.');
});
